{"class_name": "Model", "keras_version": "2.0.8", "backend": "tensorflow", "config": {"output_layers": [["concatenate_1", 0, 0]], "input_layers": [["input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input", 0, 0, {}]]], "name": "conv2d_1", "config": {"activation": "linear", "use_bias": true, "filters": 16, "name": "conv2d_1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"activation": "linear", "use_bias": true, "filters": 16, "name": "conv2d_2", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"activation": "linear", "use_bias": true, "filters": 32, "name": "conv2d_3", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"activation": "linear", "use_bias": true, "filters": 32, "name": "conv2d_4", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"activation": "linear", "use_bias": true, "filters": 32, "name": "conv2d_5", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_5", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["activation_3", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_6", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_6", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_7", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_7", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_8", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_8", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_9", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_9", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_10", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_10", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_11", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_11", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_12", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_12", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_13", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_13", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["activation_11", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_14", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_14", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"activation": "linear", "use_bias": true, "filters": 64, "name": "conv2d_15", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_15", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_16", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_16", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_16", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_17", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_17", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_18", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_18", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_19", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_19", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_20", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_20", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_20", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_21", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_21", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_22", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_22", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}], ["activation_20", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_22", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_23", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_23", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"activation": "linear", "use_bias": true, "filters": 128, "name": "conv2d_24", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_24", "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}], ["activation_22", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_24", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"activation": "softmax", "use_bias": true, "filters": 2, "name": "conv2d_25", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_26", "config": {"activation": "linear", "use_bias": true, "filters": 6, "name": "conv2d_26", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_26", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "axis": 3, "name": "concatenate_1"}}]}}