{"class_name": "Model", "keras_version": "2.0.8", "config": {"name": "model_1", "input_layers": [["input", 0, 0]], "layers": [{"name": "input", "class_name": "InputLayer", "config": {"name": "input", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_1", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_2", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_3", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_4", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 32}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_5", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_6", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_7", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_8", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_8", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_9", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_9", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_10", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_10", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_11", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_11", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_12", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_12", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_13", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_13", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_14", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_14", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_15", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 64}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_15", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_16", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_16", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_17", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_17", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_18", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_18", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_19", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_19", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_20", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_20", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["activation_18", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_21", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_21", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_22", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_22", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}], ["activation_20", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_23", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_23", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_24", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 128}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_24", "center": true, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "scale": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}], ["activation_22", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_25", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 2}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_26", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "filters": 6}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}], "output_layers": [["concatenate_1", 0, 0]]}, "backend": "tensorflow"}