{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 16, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 16, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.4}, "name": "dropout_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_4", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_5", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_5", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.4}, "name": "dropout_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_6", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_6", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_7", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_7", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_8", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_8", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_9", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_9", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_10", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_10", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.4}, "name": "dropout_3", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_11", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_11", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_12", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_12", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_13", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_13", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_14", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_14", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_15", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_15", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.4}, "name": "dropout_4", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_16", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_16", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_17", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_17", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_18", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_18", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_19", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_19", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_20", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_20", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_20", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["activation_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_21", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_21", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_22", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_22", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}], ["activation_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_23", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_23", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_24", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_24", "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}], ["activation_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 2, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_25", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "trainable": true, "filters": 6, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_26", "use_bias": true, "kernel_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "name": "concatenate_1", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "name": "model_1", "output_layers": [["concatenate_1", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}