{"keras_version": "2.0.8", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_1"}, "inbound_nodes": [[["input", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_2"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_3"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_4"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_5"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["activation_3", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_6"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_7"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_8"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_9"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_10"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_11"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_12"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_13"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["activation_11", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_14"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_15"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_16"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_16"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_17"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_17"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_18"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_18"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18"}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_19"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_19"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_20"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_20"}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_21"}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_21"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_22"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_22"}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}], ["activation_20", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_23"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_23"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_24"}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_24"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24"}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}], ["activation_22", 0, 0, {}]]], "name": "add_9"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "softmax", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 2, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_25"}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "padding": "same", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 6, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_26"}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_26", 0, 0, {}]]], "name": "concatenate_1"}], "output_layers": [["concatenate_1", 0, 0]], "input_layers": [["input", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}