{
  "backend": "tensorflow",
  "keras_version": "2.0.8",
  "class_name": "Model",
  "config": {
    "input_layers": [
      [
        "input",
        0,
        0
      ]
    ],
    "layers": [
      {
        "inbound_nodes": [],
        "name": "input",
        "class_name": "InputLayer",
        "config": {
          "sparse": false,
          "batch_input_shape": [
            null,
            null,
            null,
            3
          ],
          "name": "input",
          "dtype": "float32"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "input",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_1",
          "use_bias": true,
          "filters": 16,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_1",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_1",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_1"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_2",
          "use_bias": true,
          "filters": 16,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_2",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_2",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_2"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_1",
        "class_name": "MaxPooling2D",
        "config": {
          "pool_size": [
            2,
            2
          ],
          "name": "max_pooling2d_1",
          "data_format": "channels_last",
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "padding": "valid"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "max_pooling2d_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_3",
          "use_bias": true,
          "filters": 32,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_3",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_3",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_3"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_4",
          "use_bias": true,
          "filters": 32,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_4",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_4",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_4",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_4"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_5",
          "use_bias": true,
          "filters": 32,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_5",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_5",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ],
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_1",
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_1"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "add_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_5",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_5"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_2",
        "class_name": "MaxPooling2D",
        "config": {
          "pool_size": [
            2,
            2
          ],
          "name": "max_pooling2d_2",
          "data_format": "channels_last",
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "padding": "valid"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "max_pooling2d_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_6",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_6",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_6",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_6",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_6",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_6"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_7",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_7",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_7",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_7",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_7",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_7",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_7"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_7",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_8",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_8",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_8",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_8",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_8",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ],
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_2",
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_2"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "add_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_8",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_8"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_8",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_9",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_9",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_9",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_9",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_9",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_9",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_9"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_9",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_10",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_10",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_10",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_10",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_10",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ],
            [
              "activation_8",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_3",
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_3"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "add_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_10",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_10"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_10",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_3",
        "class_name": "MaxPooling2D",
        "config": {
          "pool_size": [
            2,
            2
          ],
          "name": "max_pooling2d_3",
          "data_format": "channels_last",
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "padding": "valid"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "max_pooling2d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_11",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_11",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_11",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_11",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_11",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_11",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_11"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_11",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_12",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_12",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_12",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_12",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_12",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_12",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_12",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_12"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_12",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_13",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_13",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_13",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_13",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_13",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_13",
              0,
              0,
              {}
            ],
            [
              "activation_11",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_4",
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_4"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "add_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_13",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_13"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_13",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_14",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_14",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_14",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_14",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_14",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_14",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_14",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_14"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_14",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_15",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_15",
          "use_bias": true,
          "filters": 64,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_15",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_15",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_15",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_15",
              0,
              0,
              {}
            ],
            [
              "activation_13",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "add_5",
        "class_name": "Add",
        "config": {
          "trainable": true,
          "name": "add_5"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "add_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_15",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_15"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_15",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_4",
        "class_name": "MaxPooling2D",
        "config": {
          "pool_size": [
            2,
            2
          ],
          "name": "max_pooling2d_4",
          "data_format": "channels_last",
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "padding": "valid"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_16",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_16",
          "use_bias": true,
          "filters": 128,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_16",
        "class_name": "BatchNormalization",
        "config": {
          "gamma_constraint": null,
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "trainable": true,
          "beta_constraint": null,
          "momentum": 0.99,
          "name": "batch_normalization_16",
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "epsilon": 0.001,
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "center": true,
          "axis": -1,
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "scale": true
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "batch_normalization_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_16",
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_16"
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "activation_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_17",
        "class_name": "Conv2D",
        "config": {
          "bias_constraint": null,
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last",
          "trainable": true,
          "kernel_size": [
            3,
            3
          ],
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "mode": "fan_avg",
              "seed": null,
              "distribution": "uniform",
              "scale": 1.0
            }
          },
          "kernel_regularizer": null,
          "name": "conv2d_17",
          "use_bias": true,
          "filters": 128,
          "activation": "linear",
          "kernel_constraint": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "dilation_rate": [
            1,
            1
          ]
        }
      },
      {
        "inbound_nodes": [
          [
            [
              "conv2d_17",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_17",
        "class_name": "BatchNormalization",
